<?php
// +----------------------------------------------------------------------
// | db.php
// +----------------------------------------------------------------------
// | Description: 数据库配置
// +----------------------------------------------------------------------
// | Time: 2018/12/7 下午5:31
// +----------------------------------------------------------------------
// | Author: Object,半醒的狐狸<2252390865@qq.com>
// +----------------------------------------------------------------------

return [
    'driver' => 'pdo',

    /**
     * 这里修改配置的时候，一定要注意将这个文件从版本控制系统中隐藏，否则会把数据库账号密码暴露出去
     */
    'pdo' => [
        'database_type' => 'mysql',
        'database_name' => 'test',
        'server' => 'mysql',
        'username' => 'root',
        'password' => 'root',
        'charset' => 'utf8',
        'port' => 3306,
//        'prefix' => '',
        'logging' => true, // 日志，如果禁用的话，可以得到更好的性能
        // 'socket' => '/tmp/mysql.sock', // socket方式连接mysql
    ],

];